# Pair Programming Limpieza I

In [2]:
import pandas as pd
pd.options.display.max_columns = None

In [5]:
df = pd.read_csv('datos/6.pandas_nuevascolumnas.csv', index_col= 0)
df.head(1)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal,sexo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018,Jun,n,F

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro anÃ¡lisis.

- Â¿Es Australia es el sitio mÃ¡s peligroso y letal para estar relajada en la playa?: country, case_number, fatal
- Â¿CuÃ¡l es el rango de edad que sufre la mayorÃ­a de los ataques?: age
- Independientemente de la edad, sufren los hombres mÃ¡s ataques que las mujeres?: sexo
- Â¿En quÃ© mes ocurren mÃ¡s ataques?: mes
- Â¿CuÃ¡l es la relaciÃ³n entre la especie y el tipo de ataque (si es fatal o no)?: species_
- Â¿CÃ³mo han evolucionado los ataques a lo largo del tiempo?: year
- De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no:

In [7]:
df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'injury', 'date',
       'mes', 'fatal', 'sexo'],
      dtype='object')

In [47]:
df_copia = df.copy()

In [48]:
df_drop = df_copia.drop(['case_number','type', 'area', 'location', 'activity', 'name', 'time', 'href', 'injury'], axis = 1)
df_drop.head(2)

     year country age     species_         date  mes fatal sexo
0  2018.0     USA  57  White shark  25-Jun-2018  Jun     n    F
1  2018.0  BRAZIL  18  Tiger shark  03-Jun-2018  Jun     y    M

2. Â¿Hay valores duplicados en nuestro dataframe? En caso de que los haya, eliminÃ¡ndlos

In [49]:
df_drop[df_drop.duplicated(['country', 'year', 'age','species_','date','mes','fatal','sexo'])].head(10)

,year,country,age,species_,date,mes,fatal,sexo
1634,0.0,IRAN,NaN,NaN,1941-1945,NaN,y,M
1642,0.0,PAPUA NEW GUINEA,NaN,NaN,World War II,WorldWarII,n,M
1654,0.0,VIETNAM,NaN,NaN,Before 1911,Before,n,M
1656,0.0,SOUTH AFRICA,NaN,NaN,Before 1921,Before,y,M
1664,0.0,AUSTRALIA,NaN,Blue pointer,Before 1906,Before,y,M
1668,0.0,AUSTRALIA,NaN,NaN,Before 1903,Before,y,M

In [50]:
df_drop.drop_duplicates(inplace=True)

In [51]:
df_drop.duplicated().sum()

0

3. Como hemos visto, algunas columnas no tienen el tipo de datos que deberÃ­an. Cambiad el tipo de dato para la columna de year.

In [52]:
df_drop['year'].dtypes

dtype('float64')

In [53]:
df_drop['year'] = df_drop['year'].astype('Int64', errors = 'raise')

In [54]:
df_drop['year'].dtypes

Int64Dtype()

4. En la columna de country poner todos los valores en minÃºsculas.
ðŸ’¡ Pista TendrÃ©is que usar una funciÃ³n o una lambda ðŸ’¡

In [59]:
df_drop['country'].dtypes

dtype('O')

In [66]:
df_drop['country'] = df_drop['country'].apply(lambda x: x.lower() if type (x) == str else str (x))

In [67]:
df_drop.head()

   year    country age          species_         date  mes fatal sexo
0  2018        usa  57       White shark  25-Jun-2018  Jun     n    F
1  2018     brazil  18       Tiger shark  03-Jun-2018  Jun     y    M
2  2018        usa  15    Bull shark, 6'  26-May-2018  May     n    M
3  2018  australia  32   Grey reef shark  24-May-2018  May     n    M
4  2018    england  21  Invalid incident  13-May-2018  May     n    M

In [68]:
df_drop.to_csv('datos_limpiezaI.csv', index = 'false')